app/controllers/movies_controller.rb

    def index
      #part 2
      @all_ratings = Movie.all_ratings
      @which_to_check = params[:ratings]
      p params[:ratings]
      if @which_to_check == nil
        @which_to_check = Hash[@all_ratings.map {|rating| [rating,1]}]
      end
      p @which_to_check


      # part 1
      @movies = Movie.with_ratings(@which_to_check.keys)
      @which_to_click = params[:which_to_click]
      if @which_to_click == "movie_title"
        @movies = @movies.order(:title)
      end

      if @which_to_click == "release_date"
        @movies = @movies.order(:release_date)
---
SELECT "movies".* FROM "movies" WHERE "movies"."ratings" IN ('G', 'PG', 'PG-13', 'R')
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY "movies"."release_date" ASC